Напишите программу, на вход которой подается одна строка с целыми числами. 
Программа должна вывести сумму этих чисел.
_________________________________________________________________________

x = input().split()
a=0
for i in x[0:]:
    a+=int(i)
print(a)
_________________________________________________________________________

print(sum(int(i) for i in input().split()))

_________________________________________________________________________

print(sum(map(int, input().split()))) # Применяет указанную функцию к каждому элементу указанной 
                                      # последовательности/последовательностей.

_________________________________________________________________________
