Напишите программу, которая считывает со стандартного ввода целые числа, 
по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел.
_____________________
a = 0
b = None
while b != 0:               # Простой пример работы цикла
    b=int(input())
    a = a + b
print(a)
______________________